grevaillot/svd_tools/headers/ATSAM3X8H/matrix.h
#pragma once 

/* --- MATRIX: AHB Bus Matrix --------------------------------------- */

/** @defgroup matrix_registers AHB Bus Matrix Register
@{*/

/** MATRIX_MATRIX_MCFG[0] Master Configuration Register **/
#define MATRIX_MATRIX_MCFG[0]			MMIO32(MATRIX_BASE + 0x00)
/** MATRIX_MATRIX_MCFG[1] Master Configuration Register **/
#define MATRIX_MATRIX_MCFG[1]			MMIO32(MATRIX_BASE + 0x04)
/** MATRIX_MATRIX_MCFG[2] Master Configuration Register **/
#define MATRIX_MATRIX_MCFG[2]			MMIO32(MATRIX_BASE + 0x08)
/** MATRIX_MATRIX_MCFG[3] Master Configuration Register **/
#define MATRIX_MATRIX_MCFG[3]			MMIO32(MATRIX_BASE + 0x0c)
/** MATRIX_MATRIX_MCFG[4] Master Configuration Register **/
#define MATRIX_MATRIX_MCFG[4]			MMIO32(MATRIX_BASE + 0x10)
/** MATRIX_MATRIX_MCFG[5] Master Configuration Register **/
#define MATRIX_MATRIX_MCFG[5]			MMIO32(MATRIX_BASE + 0x14)
/** MATRIX_MATRIX_SCFG[0] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[0]			MMIO32(MATRIX_BASE + 0x40)
/** MATRIX_MATRIX_SCFG[1] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[1]			MMIO32(MATRIX_BASE + 0x44)
/** MATRIX_MATRIX_SCFG[2] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[2]			MMIO32(MATRIX_BASE + 0x48)
/** MATRIX_MATRIX_SCFG[3] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[3]			MMIO32(MATRIX_BASE + 0x4c)
/** MATRIX_MATRIX_SCFG[4] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[4]			MMIO32(MATRIX_BASE + 0x50)
/** MATRIX_MATRIX_SCFG[5] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[5]			MMIO32(MATRIX_BASE + 0x54)
/** MATRIX_MATRIX_SCFG[6] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[6]			MMIO32(MATRIX_BASE + 0x58)
/** MATRIX_MATRIX_SCFG[7] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[7]			MMIO32(MATRIX_BASE + 0x5c)
/** MATRIX_MATRIX_SCFG[8] Slave Configuration Register **/
#define MATRIX_MATRIX_SCFG[8]			MMIO32(MATRIX_BASE + 0x60)
/** MATRIX_MATRIX_PRAS0 Priority Register A for Slave 0 **/
#define MATRIX_MATRIX_PRAS0			MMIO32(MATRIX_BASE + 0x80)
/** MATRIX_MATRIX_PRAS1 Priority Register A for Slave 1 **/
#define MATRIX_MATRIX_PRAS1			MMIO32(MATRIX_BASE + 0x88)
/** MATRIX_MATRIX_PRAS2 Priority Register A for Slave 2 **/
#define MATRIX_MATRIX_PRAS2			MMIO32(MATRIX_BASE + 0x90)
/** MATRIX_MATRIX_PRAS3 Priority Register A for Slave 3 **/
#define MATRIX_MATRIX_PRAS3			MMIO32(MATRIX_BASE + 0x98)
/** MATRIX_MATRIX_PRAS4 Priority Register A for Slave 4 **/
#define MATRIX_MATRIX_PRAS4			MMIO32(MATRIX_BASE + 0xa0)
/** MATRIX_MATRIX_PRAS5 Priority Register A for Slave 5 **/
#define MATRIX_MATRIX_PRAS5			MMIO32(MATRIX_BASE + 0xa8)
/** MATRIX_MATRIX_PRAS6 Priority Register A for Slave 6 **/
#define MATRIX_MATRIX_PRAS6			MMIO32(MATRIX_BASE + 0xb0)
/** MATRIX_MATRIX_PRAS7 Priority Register A for Slave 7 **/
#define MATRIX_MATRIX_PRAS7			MMIO32(MATRIX_BASE + 0xb8)
/** MATRIX_MATRIX_PRAS8 Priority Register A for Slave 8 **/
#define MATRIX_MATRIX_PRAS8			MMIO32(MATRIX_BASE + 0xc0)
/** MATRIX_MATRIX_MRCR Master Remap Control Register **/
#define MATRIX_MATRIX_MRCR			MMIO32(MATRIX_BASE + 0x100)
/** MATRIX_CCFG_SYSIO System I/O Configuration register **/
#define MATRIX_CCFG_SYSIO			MMIO32(MATRIX_BASE + 0x114)
/** MATRIX_MATRIX_WPMR Write Protect Mode Register **/
#define MATRIX_MATRIX_WPMR			MMIO32(MATRIX_BASE + 0x1e4)
/** MATRIX_MATRIX_WPSR Write Protect Status Register **/
#define MATRIX_MATRIX_WPSR			MMIO32(MATRIX_BASE + 0x1e8)

/**@}*/


/** @defgroup matrix_matrix_mcfg[0] MATRIXMCFG[0] Master Configuration Register
@{*/


#define MATRIX_MATRIX_MCFG[0]_ULBT_SHIFT		0
#define MATRIX_MATRIX_MCFG[0]_ULBT_MASK		0x07
/** @defgroup matrix_matrix_mcfg[0]_ulbt ULBT Undefined Length Burst Type
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_mcfg[1] MATRIXMCFG[1] Master Configuration Register
@{*/


#define MATRIX_MATRIX_MCFG[1]_ULBT_SHIFT		0
#define MATRIX_MATRIX_MCFG[1]_ULBT_MASK		0x07
/** @defgroup matrix_matrix_mcfg[1]_ulbt ULBT Undefined Length Burst Type
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_mcfg[2] MATRIXMCFG[2] Master Configuration Register
@{*/


#define MATRIX_MATRIX_MCFG[2]_ULBT_SHIFT		0
#define MATRIX_MATRIX_MCFG[2]_ULBT_MASK		0x07
/** @defgroup matrix_matrix_mcfg[2]_ulbt ULBT Undefined Length Burst Type
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_mcfg[3] MATRIXMCFG[3] Master Configuration Register
@{*/


#define MATRIX_MATRIX_MCFG[3]_ULBT_SHIFT		0
#define MATRIX_MATRIX_MCFG[3]_ULBT_MASK		0x07
/** @defgroup matrix_matrix_mcfg[3]_ulbt ULBT Undefined Length Burst Type
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_mcfg[4] MATRIXMCFG[4] Master Configuration Register
@{*/


#define MATRIX_MATRIX_MCFG[4]_ULBT_SHIFT		0
#define MATRIX_MATRIX_MCFG[4]_ULBT_MASK		0x07
/** @defgroup matrix_matrix_mcfg[4]_ulbt ULBT Undefined Length Burst Type
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_mcfg[5] MATRIXMCFG[5] Master Configuration Register
@{*/


#define MATRIX_MATRIX_MCFG[5]_ULBT_SHIFT		0
#define MATRIX_MATRIX_MCFG[5]_ULBT_MASK		0x07
/** @defgroup matrix_matrix_mcfg[5]_ulbt ULBT Undefined Length Burst Type
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[0] MATRIXSCFG[0] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[0]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[0]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[0]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[0]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[0]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[0]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[0]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[0]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[0]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[0]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[0]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[0]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[1] MATRIXSCFG[1] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[1]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[1]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[1]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[1]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[1]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[1]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[1]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[1]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[1]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[1]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[1]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[1]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[2] MATRIXSCFG[2] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[2]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[2]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[2]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[2]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[2]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[2]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[2]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[2]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[2]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[2]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[2]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[2]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[3] MATRIXSCFG[3] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[3]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[3]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[3]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[3]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[3]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[3]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


