grevaillot/svd_tools/headers/ATSAM3X8H/matrix.h
#define MATRIX_MATRIX_SCFG[3]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[3]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[3]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[3]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[3]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[3]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[4] MATRIXSCFG[4] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[4]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[4]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[4]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[4]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[4]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[4]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[4]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[4]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[4]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[4]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[4]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[4]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[5] MATRIXSCFG[5] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[5]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[5]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[5]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[5]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[5]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[5]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[5]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[5]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[5]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[5]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[5]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[5]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[6] MATRIXSCFG[6] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[6]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[6]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[6]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[6]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[6]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[6]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[6]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[6]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[6]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[6]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[6]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[6]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[7] MATRIXSCFG[7] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[7]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[7]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[7]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[7]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[7]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[7]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[7]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[7]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[7]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[7]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[7]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[7]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_scfg[8] MATRIXSCFG[8] Slave Configuration Register
@{*/


#define MATRIX_MATRIX_SCFG[8]_ARBT_SHIFT		24
#define MATRIX_MATRIX_SCFG[8]_ARBT_MASK		0x03
/** @defgroup matrix_matrix_scfg[8]_arbt ARBT Arbitration Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[8]_FIXED_DEFMSTR_SHIFT		18
#define MATRIX_MATRIX_SCFG[8]_FIXED_DEFMSTR_MASK		0x07
/** @defgroup matrix_matrix_scfg[8]_fixed_defmstr FIXEDDEFMSTR Fixed Default Master
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[8]_DEFMSTR_TYPE_SHIFT		16
#define MATRIX_MATRIX_SCFG[8]_DEFMSTR_TYPE_MASK		0x03
/** @defgroup matrix_matrix_scfg[8]_defmstr_type DEFMSTRTYPE Default Master Type
@{*/
/**@}*/


#define MATRIX_MATRIX_SCFG[8]_SLOT_CYCLE_SHIFT		0
#define MATRIX_MATRIX_SCFG[8]_SLOT_CYCLE_MASK		0xff
/** @defgroup matrix_matrix_scfg[8]_slot_cycle SLOTCYCLE Maximum Number of Allowed Cycles for a Burst
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras0 MATRIXPRAS0 Priority Register A for Slave 0
@{*/


#define MATRIX_MATRIX_PRAS0_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS0_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras0_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS0_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS0_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras0_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS0_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS0_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras0_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS0_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS0_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras0_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS0_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS0_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras0_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS0_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS0_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras0_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras1 MATRIXPRAS1 Priority Register A for Slave 1
@{*/


