grevaillot/svd_tools/headers/ATSAM3X8H/matrix.h
#define MATRIX_MATRIX_PRAS1_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS1_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras1_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS1_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS1_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras1_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS1_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS1_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras1_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS1_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS1_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras1_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS1_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS1_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras1_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS1_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS1_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras1_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras2 MATRIXPRAS2 Priority Register A for Slave 2
@{*/


#define MATRIX_MATRIX_PRAS2_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS2_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras2_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS2_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS2_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras2_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS2_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS2_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras2_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS2_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS2_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras2_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS2_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS2_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras2_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS2_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS2_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras2_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras3 MATRIXPRAS3 Priority Register A for Slave 3
@{*/


#define MATRIX_MATRIX_PRAS3_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS3_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras3_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS3_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS3_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras3_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS3_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS3_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras3_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS3_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS3_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras3_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS3_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS3_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras3_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS3_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS3_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras3_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras4 MATRIXPRAS4 Priority Register A for Slave 4
@{*/


#define MATRIX_MATRIX_PRAS4_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS4_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras4_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS4_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS4_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras4_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS4_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS4_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras4_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS4_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS4_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras4_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS4_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS4_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras4_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS4_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS4_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras4_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras5 MATRIXPRAS5 Priority Register A for Slave 5
@{*/


#define MATRIX_MATRIX_PRAS5_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS5_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras5_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS5_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS5_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras5_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS5_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS5_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras5_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS5_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS5_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras5_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS5_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS5_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras5_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS5_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS5_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras5_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras6 MATRIXPRAS6 Priority Register A for Slave 6
@{*/


#define MATRIX_MATRIX_PRAS6_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS6_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras6_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS6_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS6_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras6_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS6_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS6_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras6_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS6_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS6_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras6_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS6_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS6_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras6_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS6_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS6_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras6_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras7 MATRIXPRAS7 Priority Register A for Slave 7
@{*/


