grevaillot/svd_tools/headers/ATSAM3X8H/matrix.h
#define MATRIX_MATRIX_PRAS7_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS7_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras7_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS7_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS7_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras7_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS7_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS7_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras7_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS7_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS7_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras7_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS7_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS7_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras7_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS7_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS7_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras7_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_pras8 MATRIXPRAS8 Priority Register A for Slave 8
@{*/


#define MATRIX_MATRIX_PRAS8_M5PR_SHIFT		20
#define MATRIX_MATRIX_PRAS8_M5PR_MASK		0x03
/** @defgroup matrix_matrix_pras8_m5pr M5PR Master 5 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS8_M4PR_SHIFT		16
#define MATRIX_MATRIX_PRAS8_M4PR_MASK		0x03
/** @defgroup matrix_matrix_pras8_m4pr M4PR Master 4 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS8_M3PR_SHIFT		12
#define MATRIX_MATRIX_PRAS8_M3PR_MASK		0x03
/** @defgroup matrix_matrix_pras8_m3pr M3PR Master 3 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS8_M2PR_SHIFT		8
#define MATRIX_MATRIX_PRAS8_M2PR_MASK		0x03
/** @defgroup matrix_matrix_pras8_m2pr M2PR Master 2 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS8_M1PR_SHIFT		4
#define MATRIX_MATRIX_PRAS8_M1PR_MASK		0x03
/** @defgroup matrix_matrix_pras8_m1pr M1PR Master 1 Priority
@{*/
/**@}*/


#define MATRIX_MATRIX_PRAS8_M0PR_SHIFT		0
#define MATRIX_MATRIX_PRAS8_M0PR_MASK		0x03
/** @defgroup matrix_matrix_pras8_m0pr M0PR Master 0 Priority
@{*/
/**@}*/


/**@}*/

/** @defgroup matrix_matrix_mrcr MATRIXMRCR Master Remap Control Register
@{*/

/** MATRIX_MATRIX_MRCR_RCB5 Remap Command Bit for AHB Master 5 **/
#define MATRIX_MATRIX_MRCR_RCB5		(1 << 6)

#define MATRIX_MATRIX_MRCR_RCB4_SHIFT		4
#define MATRIX_MATRIX_MRCR_RCB4_MASK		0x03
/** @defgroup matrix_matrix_mrcr_rcb4 RCB4 Remap Command Bit for AHB Master 4
@{*/
/**@}*/

/** MATRIX_MATRIX_MRCR_RCB3 Remap Command Bit for AHB Master 3 **/
#define MATRIX_MATRIX_MRCR_RCB3		(1 << 3)
/** MATRIX_MATRIX_MRCR_RCB2 Remap Command Bit for AHB Master 2 **/
#define MATRIX_MATRIX_MRCR_RCB2		(1 << 2)
/** MATRIX_MATRIX_MRCR_RCB1 Remap Command Bit for AHB Master 1 **/
#define MATRIX_MATRIX_MRCR_RCB1		(1 << 1)
/** MATRIX_MATRIX_MRCR_RCB0 Remap Command Bit for AHB Master 0 **/
#define MATRIX_MATRIX_MRCR_RCB0		(1 << 0)

/**@}*/

/** @defgroup matrix_ccfg_sysio CCFGSYSIO System I/O Configuration register
@{*/

/** MATRIX_CCFG_SYSIO_SYSIO12 PC0 or ERASE Assignment **/
#define MATRIX_CCFG_SYSIO_SYSIO12		(1 << 12)

/**@}*/

/** @defgroup matrix_matrix_wpmr MATRIXWPMR Write Protect Mode Register
@{*/


#define MATRIX_MATRIX_WPMR_WPKEY_SHIFT		8
#define MATRIX_MATRIX_WPMR_WPKEY_MASK		0xffffff
/** @defgroup matrix_matrix_wpmr_wpkey WPKEY Write Protect KEY (Write-only)
@{*/
/**@}*/

/** MATRIX_MATRIX_WPMR_WPEN Write Protect ENable **/
#define MATRIX_MATRIX_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup matrix_matrix_wpsr MATRIXWPSR Write Protect Status Register
@{*/


#define MATRIX_MATRIX_WPSR_WPVSRC_SHIFT		8
#define MATRIX_MATRIX_WPSR_WPVSRC_MASK		0xffff
/** @defgroup matrix_matrix_wpsr_wpvsrc WPVSRC Write Protect Violation Source
@{*/
/**@}*/

/** MATRIX_MATRIX_WPSR_WPVS Write Protect Violation Status **/
#define MATRIX_MATRIX_WPSR_WPVS		(1 << 0)

/**@}*/
